; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-49)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 - object)
 (:init 
    (arm-empty)
    (clear b2)
    (on b2 b15)
    (on b15 b10)
    (on b10 b11)
    (on b11 b14)
    (on b14 b9)
    (on-table b9)
    (clear b3)
    (on-table b3)
    (clear b12)
    (on b12 b13)
    (on b13 b1)
    (on b1 b5)
    (on b5 b4)
    (on b4 b7)
    (on b7 b8)
    (on b8 b6)
    (on-table b6))
 (:goal (and 
(on-table b9)
(on b2 b1)
))
)

; plan
1. (unstack b12 b13)
   deleted: (on b12 b13) (clear b12) (arm-empty)
   added: (holding b12) (clear b13)
   goals met: 1 of 2
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 2
3. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 1 of 2
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 2
5. (unstack b2 b15)
   deleted: (on b2 b15) (clear b2) (arm-empty)
   added: (holding b2) (clear b15)
   goals met: 1 of 2
6. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 2 of 2
